// 1 Условие задачи:
//   Информация  о  файлах  на  жестких  дисках   компьютера
// записана  с  помощью  дерева.  Обеспечить выполнение следующих
// операций:
//   1) загрузку дерева в память из файла;
//   2) обход дерева папок в  режиме  диалога  (раскрытие папок,
//      подъем на уровень и т. п.);
//   3) корректировку  дерева при создании новых папок и файлов,
// их переименовании, копировании, переносе и удалении.
//   4) сохранение дерева в файле (13).
//
// 2. Автор: Никита Черемин
// 3. Среда выполнения: Linux + CLang version 10.0.1-1 + CMake version 3.18.2-1

int main(){
    return 0;
}